In [22]:
import pandas as pd
import glob

In [23]:
files = glob.glob('files_to_process/*.csv')
files

['files_to_process/D4.csv',
 'files_to_process/D5.csv',
 'files_to_process/D2.csv',
 'files_to_process/D3.csv',
 'files_to_process/D1.csv']

In [24]:
# read csv files into a dataframe withour repeating header

df = pd.concat(pd.read_csv(f, header = 0, delimiter = '|') for f in files)
df

    Name  Age  Height
0   Nana   10     127
1   Mark   10     147
2   Chew   13     165
0   Mark   10     147
1  Nueng   20     176
0  Nueng   20     176
0   Chew   13     165
0  Natty   15     157

In [25]:
# eliminate any duplicated rows
files = glob.glob('files_to_process/*.csv')
df = pd.concat(pd.read_csv(f, header = 0, delimiter = '|') for f in files)
df_deduplicated = df.drop_duplicates()
df_deduplicated

    Name  Age  Height
0   Nana   10     127
1   Mark   10     147
2   Chew   13     165
1  Nueng   20     176
0  Natty   15     157

In [26]:
df_deduplicated.reset_index(inplace = True, drop = True)

In [27]:
df_deduplicated

    Name  Age  Height
0   Nana   10     127
1   Mark   10     147
2   Chew   13     165
3  Nueng   20     176
4  Natty   15     157